denjhang/STC_Chiptune/STC32G12K128/wt.c
/* wt.c - Wavetable 4ch 合成器 (STC32G C251)
 * 参考: fm.c 架构, ArduinoUno_wavetable_synthesis (Keiji Katahira)
 * 核心: pos += step, idx = pos >> 8, out = wave[idx], out *= vol * level
 *
 * 参考 fm.c 的架构:
 *   - static 变量 (不放 xdata)
 *   - 音色模板应用到通道 (类似 fm_apply_tone)
 *   - 包络 round-robin
 *   - 无大块 xdata 缓冲区
 */

#include "STC32G.H"
#include "wt.h"

/* ========== 预置波形表 (6 x 64 bytes = 384 bytes, code 段) ========== */
static const s8 code wt_waves[384] = {
    /* 0: tri */
     0,  1,  3,  5,  7,  9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29,
    31, 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10,  8,  6,  4,  2,
     0, -2, -4, -6, -8,-10,-12,-14,-16,-18,-20,-22,-24,-26,-28,-30,
   -31,-30,-28,-26,-24,-22,-20,-18,-16,-14,-12,-10, -8, -6, -4, -2,
    /* 1: sin */
     0,  3,  6,  9, 12, 15, 17, 20, 22, 24, 26, 28, 29, 30, 31, 31,
    31, 31, 31, 30, 29, 28, 26, 24, 22, 20, 17, 15, 12,  9,  6,  3,
     0, -3, -6, -9,-12,-15,-17,-20,-22,-24,-26,-28,-29,-30,-31,-31,
   -31,-31,-31,-30,-29,-28,-26,-24,-22,-20,-17,-15,-12, -9, -6, -3,
    /* 2: saw */
     0,  0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14,
    15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
   -31,-30,-29,-28,-27,-26,-25,-24,-23,-22,-21,-20,-19,-18,-17,-16,
   -15,-14,-13,-12,-11,-10, -9, -8, -7, -6, -5, -4, -3, -2, -1,  0,
    /* 3: pulse (50% duty) */
   -21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,
   -21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,-21,
    21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21,
    21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21,
    /* 4: clipsin */
     0,  3,  6,  8, 11, 14, 17, 19, 20, 20, 20, 20, 20, 20, 20, 20,
    20, 20, 20, 20, 20, 20, 20, 20, 20, 19, 17, 14, 11,  8,  6,  3,
     0, -3, -6, -8,-11,-14,-17,-19,-20,-20,-20,-20,-20,-20,-20,-20,
   -20,-20,-20,-20,-20,-20,-20,-20,-20,-19,-17,-14,-11, -8, -6, -3,
    /* 5: abssin */
     0,  3,  6,  8, 11, 14, 17, 19, 21, 23, 25, 27, 28, 29, 30, 30,
    31, 30, 30, 29, 28, 27, 25, 23, 21, 19, 17, 14, 11,  8,  6,  3,
     0,  3,  6,  8, 11, 14, 17, 19, 21, 23, 25, 27, 28, 29, 30, 30,
    31, 30, 30, 29, 28, 27, 25, 23, 21, 19, 17, 14, 11,  8,  6,  3
};

/* ========== 包络速度表 ========== */
static const u8 code wt_env_cnt[16] = {
    0, 1, 2, 3, 4, 5, 7, 10, 13, 20, 29, 43, 64, 86, 128, 255
};

/* ========== 频率表: MIDI note 24-127 -> step ========== */
static const u16 code wt_note_freq[104] = {
    (u16)( 32.7 * 4096.0 / 17640.0 + 0.5),
    (u16)( 34.6 * 4096.0 / 17640.0 + 0.5),
    (u16)( 36.7 * 4096.0 / 17640.0 + 0.5),
    (u16)( 38.9 * 4096.0 / 17640.0 + 0.5),
    (u16)( 41.2 * 4096.0 / 17640.0 + 0.5),
    (u16)( 43.7 * 4096.0 / 17640.0 + 0.5),
    (u16)( 46.2 * 4096.0 / 17640.0 + 0.5),
    (u16)( 49.0 * 4096.0 / 17640.0 + 0.5),
    (u16)( 51.9 * 4096.0 / 17640.0 + 0.5),
    (u16)( 55.0 * 4096.0 / 17640.0 + 0.5),
    (u16)( 58.3 * 4096.0 / 17640.0 + 0.5),
    (u16)( 61.7 * 4096.0 / 17640.0 + 0.5),
    (u16)( 65.4 * 4096.0 / 17640.0 + 0.5),
    (u16)( 69.3 * 4096.0 / 17640.0 + 0.5),
    (u16)( 73.4 * 4096.0 / 17640.0 + 0.5),
    (u16)( 77.8 * 4096.0 / 17640.0 + 0.5),
    (u16)( 82.4 * 4096.0 / 17640.0 + 0.5),
    (u16)( 87.3 * 4096.0 / 17640.0 + 0.5),
    (u16)( 92.5 * 4096.0 / 17640.0 + 0.5),
    (u16)( 98.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(103.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(110.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(116.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(123.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(130.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(138.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(146.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(155.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(164.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(174.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(185.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(196.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(207.7 * 4096.0 / 17640.0 + 0.5),
    (u16)(220.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(233.1 * 4096.0 / 17640.0 + 0.5),
    (u16)(246.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(261.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(277.2 * 4096.0 / 17640.0 + 0.5),
    (u16)(293.7 * 4096.0 / 17640.0 + 0.5),
    (u16)(311.1 * 4096.0 / 17640.0 + 0.5),
    (u16)(329.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(349.2 * 4096.0 / 17640.0 + 0.5),
    (u16)(370.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(392.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(415.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(440.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(466.2 * 4096.0 / 17640.0 + 0.5),
    (u16)(493.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(523.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(554.4 * 4096.0 / 17640.0 + 0.5),
    (u16)(587.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(622.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(659.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(698.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(740.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(784.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(830.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(880.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(932.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(987.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(1046.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(1108.7 * 4096.0 / 17640.0 + 0.5),
    (u16)(1174.7 * 4096.0 / 17640.0 + 0.5),
    (u16)(1244.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(1318.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(1396.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(1480.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(1568.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(1661.2 * 4096.0 / 17640.0 + 0.5),
    (u16)(1760.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(1864.7 * 4096.0 / 17640.0 + 0.5),
    (u16)(1975.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(2093.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(2217.5 * 4096.0 / 17640.0 + 0.5),
    (u16)(2349.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(2489.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(2637.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(2793.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(2960.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(3136.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(3322.4 * 4096.0 / 17640.0 + 0.5),
    (u16)(3520.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(3729.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(3951.1 * 4096.0 / 17640.0 + 0.5),
    (u16)(4186.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(4434.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(4698.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(4978.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(5274.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(5587.7 * 4096.0 / 17640.0 + 0.5),
    (u16)(5919.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(6271.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(6644.9 * 4096.0 / 17640.0 + 0.5),
    (u16)(7040.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(7458.6 * 4096.0 / 17640.0 + 0.5),
    (u16)(7902.1 * 4096.0 / 17640.0 + 0.5),
    (u16)(8372.0 * 4096.0 / 17640.0 + 0.5),
    (u16)(8869.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(9397.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(9956.1 * 4096.0 / 17640.0 + 0.5),
    (u16)(10548.1 * 4096.0 / 17640.0 + 0.5),
    (u16)(11175.3 * 4096.0 / 17640.0 + 0.5),
    (u16)(11839.8 * 4096.0 / 17640.0 + 0.5),
    (u16)(12543.9 * 4096.0 / 17640.0 + 0.5)
};

/* ========== 通道状态 (参考 fm.c FmOp) ========== */
static struct {
    u16 pos;
    u16 step;
    u8  vol;
    u8  env_state;
    u8  env_cnt;
    u8  atk;
    u8  decy;
    u8  sul;
    u8  sus;
    u8  rel;
    u8  level;
    u8  wave_idx;
    u8  env_step;
} wt_ch[WT_CHANS];

static u8 wt_voice_active;

/* 音色模板 (全局共用, 参考 fm_tone) */
static struct {
    u8 atk, decy, sul, sus, rel;
    u8 wave_idx;
} wt_tone;

static u8 wt_wait_cnt;

/* ========== 音色模板应用到通道 (参考 fm_apply_tone) ========== */
static void wt_apply_tone(u8 ch) {
    wt_ch[ch].atk  = wt_tone.atk;
    wt_ch[ch].decy = wt_tone.decy;
    wt_ch[ch].sul  = wt_tone.sul;
    wt_ch[ch].sus  = wt_tone.sus;
    wt_ch[ch].rel  = wt_tone.rel;
    wt_ch[ch].wave_idx = wt_tone.wave_idx;
}

/* ========== 包络更新 (参考 fm_env_tick) ========== */
static void wt_env_tick(u8 ch) {
    u8 cnt, step, lvl;

    cnt = wt_ch[ch].env_cnt;
    step = wt_ch[ch].env_step;
    if (cnt >= step) {
        wt_ch[ch].env_cnt = cnt - step;
        return;
    }

    wt_ch[ch].env_cnt = 250;
    lvl = wt_ch[ch].level;

    switch (wt_ch[ch].env_state) {
    case 1: /* attack */
        lvl++;
        if (lvl >= 31) {
            wt_ch[ch].env_state = 2;
            wt_ch[ch].env_step = wt_ch[ch].decy;
        }
        wt_ch[ch].level = lvl;
        break;
    case 2: /* decay */
        if (lvl > 0) lvl--;
        wt_ch[ch].level = lvl;
        if (lvl == wt_ch[ch].sul) {
            wt_ch[ch].env_state = 3;
            wt_ch[ch].env_step = wt_ch[ch].sus;
        }
        break;
    case 3: /* sustain */
        if (lvl > 0) lvl--;
        wt_ch[ch].level = lvl;
        if (lvl == 0) wt_ch[ch].step = 0;
        break;
    case 4: /* release */
        if (lvl > 0) lvl--;
        wt_ch[ch].level = lvl;
        if (lvl == 0) {
            wt_ch[ch].step = 0;
            wt_voice_active &= ~(1 << ch);
        }
        break;
    }
}

/* ========== 公开函数 ========== */

void wt_init(void) {
    u8 i;

    wt_tone.atk = wt_env_cnt[14];
    wt_tone.decy = wt_env_cnt[9];
    wt_tone.sul = 13;
    wt_tone.sus = wt_env_cnt[3];
    wt_tone.rel = wt_env_cnt[7];
    wt_tone.wave_idx = 1;

    for (i = 0; i < WT_CHANS; i++) {
        wt_ch[i].pos = 0;
        wt_ch[i].step = 0;
        wt_ch[i].vol = 31;
        wt_ch[i].env_state = 0;
        wt_ch[i].env_cnt = 0;
        wt_ch[i].level = 0;
        wt_ch[i].wave_idx = 1;
        wt_ch[i].env_step = 0;
    }
    wt_voice_active = 0;
    wt_wait_cnt = 0;
}

void wt_wr(u8 addr, u8 dat) {
    u8 ch, note;
    u16 f;

    if (addr < 0x04) {
        ch = addr;
        note = dat;
        if (note < 24) note = 24;
        if (note > 127) note = 127;
        note -= 24;
        f = wt_note_freq[note];

        wt_apply_tone(ch);

        wt_ch[ch].step = f;
        wt_ch[ch].pos = 0;
        wt_ch[ch].env_state = 1;
        wt_ch[ch].env_cnt = 250;
        wt_ch[ch].level = 0;
        wt_ch[ch].env_step = wt_ch[ch].atk;
        wt_voice_active |= (1 << ch);

    } else if (addr < 0x08) {
        ch = addr - 4;
        if (wt_ch[ch].step == 0) return;
        wt_ch[ch].env_state = 4;
        wt_ch[ch].env_step = wt_ch[ch].rel;

    } else if (addr < 0x0C) {
        ch = addr - 8;
        wt_ch[ch].vol = dat & 0x1F;

    } else if (addr == 0x10) {
        wt_tone.atk = wt_env_cnt[(dat >> 4) & 0x0F];
        wt_tone.decy = wt_env_cnt[dat & 0x0F];

    } else if (addr == 0x11) {
        wt_tone.sul = (dat >> 4) & 0x0F;
        wt_tone.sul = wt_tone.sul == 15 ? 0 : 31 - wt_tone.sul * 2;
        wt_tone.sus = wt_env_cnt[dat & 0x0F];

    } else if (addr == 0x12) {
        wt_tone.rel = wt_env_cnt[dat & 0x0F];

    } else if (addr == 0x13) {
        wt_tone.wave_idx = dat % 6;
    }
}

s16 wt_render(void) {
    u8 ch, idx, lvl, vol, wi;
    s8 wave_val;
    s16 ch_out, total;
    u16 pos, step;

    wt_wait_cnt++;
    wt_wait_cnt &= 0x03;

    total = 0;

    for (ch = 0; ch < WT_CHANS; ch++) {
        if (wt_ch[ch].step == 0) continue;

        pos = wt_ch[ch].pos;
        step = wt_ch[ch].step;
        pos += step;
        wt_ch[ch].pos = pos;

        idx = (u8)(pos >> 6) & 0x3F;

        wi = wt_ch[ch].wave_idx;
        wave_val = wt_waves[(u16)(wi << 6) | idx];

        if (wt_wait_cnt == ch) {
            wt_env_tick(ch);
        }

        lvl = wt_ch[ch].level;
        vol = wt_ch[ch].vol;
        ch_out = (s16)wave_val * (s16)(lvl + 1) * (s16)(vol + 1);
        ch_out >>= 10;

        total += ch_out;
    }

    return total;
}

u8 wt_channel_mask(void) {
    u8 mask = 0, i;
    for (i = 0; i < WT_CHANS; i++) {
        if (wt_ch[i].step) {
            mask |= (1 << i);
        }
    }
    return mask;
}
